kfk-mobile_dev/src/Documents/ОФ_ОценкаКачестваУборкиУрожая/ОФ_ОценкаКачестваУборкиУрожая.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОФ_ОценкаКачестваУборкиУрожая</name>
  <posting>Deny</posting>
  <attributes>
    <name>Поле</name>
    <type>
      <types>CatalogRef.АпкПоля</types>
    </type>
  </attributes>
  <attributes>
    <name>Помология</name>
    <type>
      <types>CatalogRef.АпкПартии</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродукцияСортовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНесоответствий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерОбъединеннойПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНессответсвий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Контейнеры</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодОтсканирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиКачества</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ОФ_ПоказателиКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Фото</name>
    <attributes>
      <name>АдресНаДиске</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндексФото</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресХранилища</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКомандыУдалить</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

kfk-mobile_dev/src/Documents/ОФ_ОценкаКачестваУборкиУрожая/Forms/ОценкиЗаДень/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Период = ТекущаяДата();
	ОтборСортоваяПродукция = 1;
	ЗаполнитьОценкиЗаПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьОценкаКачества" Тогда 
		ЗаполнитьОценкиЗаПериод();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОценкиЗаПериод()

	ОценкиКачества.Очистить();

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОценкиКачества.Бригада,
	|	СУММА(ОценкиКачества.КоличествоНесоответствий) / СУММА(ОценкиКачества.РазмерОбъединеннойПробы) * 100 КАК ПроцентНессответсвий,
	|	100 - (СУММА(ОценкиКачества.КоличествоНесоответствий) / СУММА(ОценкиКачества.РазмерОбъединеннойПробы) * 100) КАК ПроцентСоответствия,
	|	СУММА(ОценкиКачества.РазмерОбъединеннойПробы) КАК РазмерОбъединеннойПробы,
	|	КОЛИЧЕСТВО(ОценкиКачества.Ссылка) КАК КоличествоПроб
	|ИЗ
	|	Документ.ОФ_ОценкаКачестваУборкиУрожая КАК ОценкиКачества
	|ГДЕ
	|	НЕ ОценкиКачества.ПометкаУдаления
	|	И ОценкиКачества.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ОценкиКачества.ПродукцияСортовая = &ПродукцияСортовая Или ОценкиКачества.ПродукцияСортовая = 0)
	|СГРУППИРОВАТЬ ПО
	|	ОценкиКачества.Бригада");

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период));
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(Период));
	Запрос.УстановитьПараметр("ПродукцияСортовая",  ОтборСортоваяПродукция);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ОценкиКачества.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Оценка = ОценкаКачестваКлиентСервер.ПолучитьОценку(НоваяСтрока.ПроцентСоответствия);
		Если Оценка > 0 И Оценка <=5 Тогда   
			НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок["Цифра" + Строка(Оценка)];
		Иначе
			НоваяСтрока.КартинкаСтроки = Новый Картинка;	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокФормы()

	Заголовок = Формат(Период, "ДФ='dd MMMM';")

КонецПроцедуры

&НаКлиенте
Процедура ОценкиКачестваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНазадНажатие(Элемент)

	Период = Период - 86400;
	ЗаполнитьОценкиЗаПериод();

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВпередНажатие(Элемент)
	
	Период = Период + 86400;
	ЗаполнитьОценкиЗаПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЗаполнитьОценкиЗаПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура Сорт(Команда)
	
	ОтборСортоваяПродукция = 1;
	ЗаполнитьОценкиЗаПериод();
КонецПроцедуры

&НаКлиенте
Процедура НеСорт(Команда)
	ОтборСортоваяПродукция = 2;
	ЗаполнитьОценкиЗаПериод();
	
КонецПроцедуры
